package cn.flyexp.douban_movie.model;

/**
 * Created by Won on 2017/3/13.
 */

public class TagData {

    public static String[] types = {"爱情", "喜剧", "剧情", "动画", "科幻", "动作", "经典", "悬疑", "青春",
            "犯罪", "惊悚", "文艺", "搞笑", "纪录片", "励志", "恐怖", "战争", "短片", "黑色幽默", "魔幻",
            "传记", "情色", "感人", "暴力", "家庭", "音乐", "动画短片", "童年", "浪漫", "黑帮", "女性",
            "同志", "史诗", "烂片", "童话", "西部"};

    public static String[] countrys = {"美国", "日本", "香港", "英国", "中国", "韩国", "法国", "台湾",
            "中国大陆", "德国", "意大利", "印度", "内地", "泰国", "西班牙", "欧洲", "加拿大", "澳大利亚",
            "俄罗斯", "伊朗", "爱尔兰", "瑞典", "巴西", "丹麦", "波兰", "捷克", "阿根廷", "比利时", "墨西哥",
            "新西兰", "荷兰", "奥地利", "土耳其", "匈牙利", "以色列", "瑞士"};

    public static String[] artists = {"周星驰", "宫崎骏", "王家卫", "JohnnyDepp", "梁朝伟", "张艺谋",
            "尼古拉斯·凯奇", "斯皮尔伯格", "成龙", "刘德华", "岩井俊二", "张国荣", "冯小刚", "杜琪峰",
            "李连杰", "徐克", "姜文", "李安", "TimBurton", "桂纶镁", "周迅", "周润发", "金城武", "刘青云",
            "舒淇", "王晶", "希区柯克", "新海诚", "汤姆·汉克斯", "吴彦祖", "奥黛丽·赫本", "AnneHathaway",
            "科恩兄弟", "JimCarrey", "贾樟柯", "黑泽明"};

    public static String[] years = {"2016", "2015", "2013", "2014", "2011", "2012", "2010", "2009", "2008",
            "2007", "2006", "2004", "2005", "2003", "2001", "2002", "1994", "2000", "1997", "1999", "1998",
            "1995", "1996", "1993", "1992", "1990", "1991", "1988"};
}